; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation0 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Planet6 thermograph1)
	(have_image Planet7 infrared0)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 infrared0)
	(have_image Planet16 thermograph1)
	(have_image Phenomenon17 thermograph1)
	(have_image Planet18 infrared0)
))

)

; plan
1. (turn_to satellite0 star5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star5)
   goals met: 0 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 13
5. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 1 of 13
6. (turn_to satellite0 phenomenon17 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 13
7. (take_image satellite0 phenomenon17 instrument1 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon14 instrument1 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 13
12. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 13
13. (take_image satellite0 planet10 instrument1 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 5 of 13
14. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 13
15. (take_image satellite0 planet12 instrument1 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 13
16. (turn_to satellite0 planet15 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet15)
   goals met: 6 of 13
17. (take_image satellite0 planet15 instrument1 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 7 of 13
18. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 7 of 13
19. (take_image satellite0 planet16 instrument1 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 8 of 13
20. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 8 of 13
21. (take_image satellite0 planet18 instrument1 infrared0)
   added: (have_image planet18 infrared0)
   goals met: 9 of 13
22. (turn_to satellite0 planet6 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet6)
   goals met: 9 of 13
23. (take_image satellite0 planet6 instrument1 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 10 of 13
24. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 10 of 13
25. (take_image satellite0 planet7 instrument1 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 11 of 13
26. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 11 of 13
27. (take_image satellite0 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 12 of 13
28. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 12 of 13
29. (take_image satellite0 star13 instrument1 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 13 of 13
